Dynamo.Logging.AnalyticsService.Start(Dynamo.Models.DynamoModel,System.Boolean,System.Boolean,System.Boolean)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: DynamoModel
disableADP: Pass true to disable ADP for the lifetime of the Dynamo or host process
isHeadless: Analytics won't be started if IsHeadless, but ADP may be loaded to be disabled.
isTestMode: Analytics won't be started if isTestMode, ADP will not be loaded.