Dynamo.Search.SearchDictionary`1.Search(System.String,System.Int32,System.Collections.Generic.IEnumerable{Dynamo.Search.SearchElements.NodeSearchElement})
Search for elements in the dictionary or subset based on the query
query:  The query
minResultsForTolerantSearch: Minimum number of results in the original search strategy to justify doing more tolerant search
subset: Subset of nodes that should be used for the search instead of the complete set of nodes