Dynamo.Utilities.LuceneSearchUtility.UpdateIndexedNodesInfo(System.Collections.Generic.List{Dynamo.Search.SearchElements.NodeSearchElement})
Remove all the current indexed node info and update it with the new ones passed as parameter
nodeList: list of nodes to be indexed

Dynamo.Utilities.LuceneSearchUtility.CreateSearchQuery(System.String[],System.String,System.Boolean)
Creates a search query with adjusted priority, fuzzy logic and wildcards.
Complete Search term appearing in Name of the package will be given highest priority.
Then, complete search term appearing in other metadata,
Then, a part of the search term(if containing multiple words) appearing in Name of the package
Then, a part of the search term appearing in other metadata of the package.
Then priority will be given based on fuzzy logic- that is if the complete search term may have been misspelled for upto 2(max edits) characters.
Then, the same fuzzy logic will be applied to each part of the search term.
fields: All fields to be searched in.
SearchTerm: Search key to be searched for.
IsPackageContext: Set this to true if the search context is packages instead of nodes.
Returns: