Dynamo.Properties.Resources.InputNodeRenameHint
Looks up a localized string similar to default input name, rename me!.

Dynamo.Properties.Resources.PackageManagerPackagePreviewCounter
Looks up a localized string similar to {0} files and {1} folders will be created..

Dynamo.Properties.Resources.PackageManagerPackageSelectCounter
Looks up a localized string similar to {0} files and {1} folders loaded..